; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v3 - type_1 ?v6 - type_3)
 	      (pred_4 ?v2 - object ?v6 - type_3)
	      (pred_3 ?v3 - type_1 ?v1 - type_2)
	      (pred_1 ?v3 - type_1 ?v2 - object ?v1 - type_2))

   (:action op_3
       :parameters  (?v3 - type_1 ?v8 ?v4 - type_3)
       :precondition (and  (pred_2 ?v3 ?v8))
       :effect (and  (pred_2 ?v3 ?v4)
		     (not (pred_2 ?v3 ?v8))))

   (:action op_1
       :parameters (?v3 - type_1 ?v7 - object ?v5 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_4 ?v7 ?v5) (pred_2 ?v3 ?v5) (pred_3 ?v3 ?v1))
       :effect (and (pred_1 ?v3 ?v7 ?v1)
		    (not (pred_4 ?v7 ?v5)) 
		    (not (pred_3 ?v3 ?v1))))

   (:action op_2
       :parameters (?v3 - type_1 ?v7 - object ?v5 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v3 ?v7 ?v1) (pred_2 ?v3 ?v5))
       :effect (and (pred_4 ?v7 ?v5)
		    (pred_3 ?v3 ?v1)
		    (not (pred_1 ?v3 ?v7 ?v1)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_01 obj_11 - type_1
obj_05 obj_09 obj_12 obj_07 - type_2
obj_04 obj_08 obj_02 - type_3
obj_10 obj_06 obj_03 - object)
(:init
(pred_2 obj_01 obj_08)
(pred_3 obj_01 obj_05)
(pred_3 obj_01 obj_09)
(pred_2 obj_11 obj_08)
(pred_3 obj_11 obj_12)
(pred_3 obj_11 obj_07)
(pred_4 obj_10 obj_08)
(pred_4 obj_06 obj_02)
(pred_4 obj_03 obj_02)
)
(:goal
(and
(pred_4 obj_10 obj_08)
(pred_4 obj_06 obj_04)
(pred_4 obj_03 obj_04)
)
)

(:constraints
  (always (not (pred_2 obj_01 obj_02)))
)
)

; plan
1. (op_3 obj_01 obj_08 obj_04)
   deleted: (pred_2 obj_01 obj_08)
   added: (pred_2 obj_01 obj_04)
   goals met: 1 of 3
2. (op_3 obj_11 obj_08 obj_02)
   deleted: (pred_2 obj_11 obj_08)
   added: (pred_2 obj_11 obj_02)
   goals met: 1 of 3
3. (op_1 obj_11 obj_03 obj_02 obj_07)
   deleted: (pred_4 obj_03 obj_02) (pred_3 obj_11 obj_07)
   added: (pred_1 obj_11 obj_03 obj_07)
   goals met: 1 of 3
4. (op_1 obj_11 obj_06 obj_02 obj_12)
   deleted: (pred_4 obj_06 obj_02) (pred_3 obj_11 obj_12)
   added: (pred_1 obj_11 obj_06 obj_12)
   goals met: 1 of 3
5. (op_3 obj_11 obj_02 obj_04)
   deleted: (pred_2 obj_11 obj_02)
   added: (pred_2 obj_11 obj_04)
   goals met: 1 of 3
6. (op_2 obj_11 obj_03 obj_04 obj_07)
   deleted: (pred_1 obj_11 obj_03 obj_07)
   added: (pred_4 obj_03 obj_04) (pred_3 obj_11 obj_07)
   goals met: 2 of 3
7. (op_2 obj_11 obj_06 obj_04 obj_12)
   deleted: (pred_1 obj_11 obj_06 obj_12)
   added: (pred_4 obj_06 obj_04) (pred_3 obj_11 obj_12)
   goals met: 3 of 3
